InformationRegisters/АгентыЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АгентыЦелевые</Name>
			<Comment>Реестр агентов все звонки которым считаются целевыми</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаЦелевая</Name>
					<Comment>Точка для которой оператор является целевым</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачБлокировки</Name>
					<Comment>Дата и время начала блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонБлокировки</Name>
					<Comment>Дата и время окончания блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстБлокировки</Name>
					<Comment>Причина блокировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИницаторБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВизитнаяКарточка</Name>
					<Comment>Текст визитной карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеБлокироватьЗаЗвонкиОжидающиеОбработкиБолееСуток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Внутренний целевой телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АгентыЦелевые/Forms/ФормаАгента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Сформируем сведения о телефоне и конвергентной паре
//-------------------------------------------------------------------------------------------------
	ПараФМС = "";
	Элементы.НадписьТелефон.Заголовок = "Агент: " + СокрЛП(Запись.Телефон) + ПараФМС;

// Сформируем сведения о владельце номера
//-------------------------------------------------------------------------------------------------
	ВладСсылка = Телефония.ВладелецПолучить(Запись.Телефон);

	Если (ЗначениеЗаполнено(ВладСсылка)) Тогда
		Темп = СокрЛП(ВладСсылка) + ", " + СокрЛП(ВладСсылка.ТочкаРазмещения);
		Элементы.НадписьВладелец.ЦветТекста = Новый Цвет(0,51,102);
		Элементы.НадписьВладелец.Заголовок = СокрЛП(Темп);
		Элементы.НадписьВладелец.Гиперссылка = Истина;
	КонецЕсли;

// Получим список системных очередей, в которых зарегистрирован данный телефон в качестве агента
//-------------------------------------------------------------------------------------------------
	МассивОчередей = ОчередиАгенты.ОчередиПолучитьПоАгенту(Запись.Телефон);

	Если (ТипЗнч(МассивОчередей) = Тип("Массив")) Тогда
		Темп = "Является агентом очередей (" + СокрЛП(МассивОчередей.Количество()) + ")";
		Элементы.НадписьОчереди.ЦветТекста = Новый Цвет(0,51,102);
		Элементы.НадписьОчереди.Заголовок = СокрЛП(Темп);
		Элементы.НадписьОчереди.Гиперссылка = Истина;
	КонецЕсли;

// Отображение элементов группы с параметрами блокировки
//-------------------------------------------------------------------------------------------------
	Доступно = (Запись.КонБлокировки > ТекущаяДата());
	ЦветФона = ?(Доступно,Новый Цвет(255,255,153),ЦветаСтиля.ЦветФонаФормы);
	Элементы.ГруппаБлокировка.ЦветФона = ЦветФона;

	Если (Доступно = Ложь) Тогда
		Запись.ТекстБлокировки = Неопределено;
		Запись.НачБлокировки = Неопределено;
		Запись.КонБлокировки = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Запись.Телефон,ЭтаФорма);
	ПриСозданииНаСервере(Ложь,Истина);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура НадписьОчередиНажатие(Элемент)

// Откроем форму спика системных очередей и покажем в ней только те очереди агентом которых
// является текущий номер телефона
//-------------------------------------------------------------------------------------------------
	МассивОчередей = ОчередиАгенты.ОчередиПолучитьПоАгенту(Запись.Телефон);

	Если (ТипЗнч(МассивОчередей) = Тип("Массив")) Тогда
		Форма = ПолучитьФорму("Справочник.ТелОчереди.ФормаСписка",,,,ВариантОткрытияОкна.ОтдельноеОкно);

		ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= МассивОчередей;
		ЭлементОтбора.Использование		= Истина;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НадписьТелефонНажатие(Элемент)

// Откроем форму элемента "Внутренний телефон"
//-------------------------------------------------------------------------------------------------
	Попытка
		ОткрытьЗначение(Запись.Телефон);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура НадписьВладелецНажатие(Элемент)

// Откроем форму элемента "Предприятие"
//-------------------------------------------------------------------------------------------------
	Попытка
		ВладСсылка = Телефония.ВладелецПолучить(Запись.Телефон);
		ОткрытьЗначение(ВладСсылка);
	Исключение
	КонецПопытки;
КонецПроцедуры
